{
  "Home": {
    "title1": "Trustline",
    "title2": "Checker",
    "subtitle": "Is your wallet configuration really safe?",
    "description": "This service aims to check the status of your wallet and update it safely as needed.",
    "alert": "Currently, only the Domain and EmailHash features are implemented. Other items will be added in the future.",
    "table": {
      "header": {
        "token": "Token",
        "rippling": "Rippling",
        "limit": "Limit",
        "balance": "Balance"
      }
    }
  },
  "CardAccountInfo": {
    "trustlines": {
      "description": "Coming soon"
    }
  },
  "WalletConnectButton": {
    "label": "Connect Wallet",
    "modal": {
      "title": "Please select a wallet",
      "close": "Close"
    }
  },
  "WalletMenuButton": {
    "disconnect": "Disconnect"
  },
  "Error": {
    "config": {
      "label": "Error"
    },
    "msg": {
      "E_001_001": "Failed to connect wallet",
      "E_001_002": "Unsupported network"
    }
  },
  "About": {
    "title": "TrustlineChecker",
    "lead1": "TrustlineChecker is an all-in-one platform that makes account management on the XRP Ledger smarter and safer.",
    "lead2": "From trustline checks and settings, AccountRoot updates, to wallet security management—all in one place.",
    "lead3": "Combining reliability and efficiency, we deliver a secure experience to XRPL users worldwide.",
    "project": "Project Overview",
    "project1": "TrustlineChecker is a global platform that allows users to safely and intuitively manage trustlines and account roots as account management becomes increasingly important with the expansion of the XRPL ecosystem.",
    "project2": "By fully utilizing XRPL's flexible account settings (e.g., Trust Lines, AccountSet), we meet user needs in growing areas such as DeFi, NFT, and cross-border payments.",
    "features": "Key Features",
    "feature1": "Trustline Management (using account_lines method):\n・Add or remove trustlines in just a few clicks\n・View trustline status (balance, limit, currency code) in real time",
    "feature2": "AccountRoot Management (using account_info method):\n・Visualize AccountRoot details (XRP balance, sequence number, flags, etc.)\n・Simplify settings changes (e.g., Require Auth, No Freeze, Domain)",
    "feature3": "Global Optimization:\n・Multilingual interface (Arabic, English, Japanese, Korean, Chinese) supported"
  }
}
